In [2]:
import pandas as pd

In [3]:
# let's create a dataFrame of treams:

stats = pd.DataFrame({
    'teams' : ['Pakistan','India', 'Srilanka', 'South Africa','West Indies', 'Bangladesh', 'Newzland'],
    'played' : [6,4,3,5,1,7,8],
    'points' : [10,4,6,8,5,3,12]
})
stats

          teams  played  points
0      Pakistan       6      10
1         India       4       4
2      Srilanka       3       6
3  South Africa       5       8
4   West Indies       1       5
5    Bangladesh       7       3
6      Newzland       8      12

# Head :
* `variable.head()`
* it shows first 5 rows by default but we can specify the number of rows as:
     * `variable.head(n)` where n can be any number

In [7]:
stats.head() # by default first 5 rows

          teams  played  points
0      Pakistan       6      10
1         India       4       4
2      Srilanka       3       6
3  South Africa       5       8
4   West Indies       1       5

In [8]:
stats.head(3) # custom number of rows

      teams  played  points
0  Pakistan       6      10
1     India       4       4
2  Srilanka       3       6

# Tail
* `variable.tail()`
* it shows last 5 rows of dataframe by default but we can specify the number of rows as:
     * `variable.tail(n)` where n can be any number

In [9]:
stats.tail() # by default last 5 rows

          teams  played  points
2      Srilanka       3       6
3  South Africa       5       8
4   West Indies       1       5
5    Bangladesh       7       3
6      Newzland       8      12

In [10]:
stats.tail(3) # custom number of rows

         teams  played  points
4  West Indies       1       5
5   Bangladesh       7       3
6     Newzland       8      12

In [11]:
# for any specific column data:
stats["teams"]

0        Pakistan
1           India
2        Srilanka
3    South Africa
4     West Indies
5      Bangladesh
6        Newzland
Name: teams, dtype: object

In [12]:
stats.iloc[1:5] #slicing

          teams  played  points
1         India       4       4
2      Srilanka       3       6
3  South Africa       5       8
4   West Indies       1       5

In [15]:
stats.loc[1] # index specific accessing

teams     India
played        4
points        4
Name: 1, dtype: object

In [16]:
stats

          teams  played  points
0      Pakistan       6      10
1         India       4       4
2      Srilanka       3       6
3  South Africa       5       8
4   West Indies       1       5
5    Bangladesh       7       3
6      Newzland       8      12

# to specify custom indexes

In [4]:
stats.index = ['t1', 't2', 't3', 't4','t5', 't6', 't7']

In [5]:
stats

           teams  played  points
t1      Pakistan       6      10
t2         India       4       4
t3      Srilanka       3       6
t4  South Africa       5       8
t5   West Indies       1       5
t6    Bangladesh       7       3
t7      Newzland       8      12

In [33]:
# now use loc to get any teams data:
stats.loc["t1"] # for row data

teams     Pakistan
played           6
points          10
Name: t1, dtype: object

In [40]:
stats.iloc[1:5] # for specific number of rows index data

           teams  played  points
t2         India       4       4
t3      Srilanka       3       6
t4  South Africa       5       8
t5   West Indies       1       5

In [41]:
# to get a numpy array:

stats.values

array([['Pakistan', 6, 10],
       ['India', 4, 4],
       ['Srilanka', 3, 6],
       ['South Africa', 5, 8],
       ['West Indies', 1, 5],
       ['Bangladesh', 7, 3],
       ['Newzland', 8, 12]], dtype=object)

In [42]:
import numpy as np

In [60]:
stats['S.No'] = np.arange(1,8)

In [61]:
stats

           teams  played  points  S.No
t1      Pakistan       6      10     1
t2         India       4       4     2
t3      Srilanka       3       6     3
t4  South Africa       5       8     4
t5   West Indies       1       5     5
t6    Bangladesh       7       3     6
t7      Newzland       8      12     7

In [62]:
#slicing :
stats.iloc[0:5,0] # frame.iloc[row , column]

t1        Pakistan
t2           India
t3        Srilanka
t4    South Africa
t5     West Indies
Name: teams, dtype: object

In [63]:
stats.values

array([['Pakistan', 6, 10, 1],
       ['India', 4, 4, 2],
       ['Srilanka', 3, 6, 3],
       ['South Africa', 5, 8, 4],
       ['West Indies', 1, 5, 5],
       ['Bangladesh', 7, 3, 6],
       ['Newzland', 8, 12, 7]], dtype=object)

# in-palce/ in-memory:
* means that the changes are done but are not stored in our original dataFrame
* the changes will not be applied on the original frame.

In [64]:
stats.drop('S.No', axis = 1) # it is returning a new frame & changes are not done in original frame.

           teams  played  points
t1      Pakistan       6      10
t2         India       4       4
t3      Srilanka       3       6
t4  South Africa       5       8
t5   West Indies       1       5
t6    Bangladesh       7       3
t7      Newzland       8      12

In [6]:
# but if we check original frame, it is not changed yet
stats

           teams  played  points
t1      Pakistan       6      10
t2         India       4       4
t3      Srilanka       3       6
t4  South Africa       5       8
t5   West Indies       1       5
t6    Bangladesh       7       3
t7      Newzland       8      12

### so we will set `inplace = true` for permanent changes in frame.

In [66]:
stats.drop('S.No', axis = 1, inplace = True) #it hasn't returned any frame as 
                                                #it changed original frame.

In [7]:
stats # now S.No column is dropped from the original frame too.

           teams  played  points
t1      Pakistan       6      10
t2         India       4       4
t3      Srilanka       3       6
t4  South Africa       5       8
t5   West Indies       1       5
t6    Bangladesh       7       3
t7      Newzland       8      12

In [9]:
# Apply Function:
stats['win'] = stats['points']/2

# to change data type :
* `variable.astype()`
* in tensorflow we work on only int data. so we need to change data type

In [10]:
stats['win'] = stats['win'].astype(int)

In [11]:
stats

           teams  played  points  win
t1      Pakistan       6      10    5
t2         India       4       4    2
t3      Srilanka       3       6    3
t4  South Africa       5       8    4
t5   West Indies       1       5    2
t6    Bangladesh       7       3    1
t7      Newzland       8      12    6

In [12]:
def calc_loss(r):
    return r['played'] - r['win']

In [13]:
stats['loss_tie'] = stats.apply(calc_loss,axis = 1)

In [14]:
stats

           teams  played  points  win  loss_tie
t1      Pakistan       6      10    5         1
t2         India       4       4    2         2
t3      Srilanka       3       6    3         0
t4  South Africa       5       8    4         1
t5   West Indies       1       5    2        -1
t6    Bangladesh       7       3    1         6
t7      Newzland       8      12    6         2

In [ ]:
# this funtion calc_loss will be called 7 times as:

* #0	Pakistan	6	10	5
* #1	India	4	4	2	
* #2	Srilanka	3	6	3
* #3	South Africa	5	8	4
* #4	West Indies	1	5	2
* #5	Bangladesh	7	3	1
* #6	Newzland	8	12	6

In [ ]:
# the above task can be done without using function as:

# stats['loss_tie'] = stats['played'] - stats['win']

# to find the maximum among the frames we use .max() function:

* `frame['column_name'].max()`

In [12]:
stats['played'].max()

8

# to find the minimum among the frames we use .min() function:

* `frame['column_name'].min()`

In [13]:
stats['played'].min()

1

### to get the index of the team with maximum points we use .idxmax() function:
* `frame['column_name'].idxmax()`

In [28]:
stats['points'].idxmax()

6

### to get the index of the team with minimum points we use .idxmin() function:
* `frame['column_name'].idxmin()`

In [9]:
stats['points'].idxmin()

't6'

In [22]:
# store that index in a variable so we can use it later to find more info about it.
index = stats['points'].idxmax()
index

6

In [23]:
# Using .iloc[] to find the whole info about the index...
stats.iloc[index]

teams       Newzland
played             8
points            12
win                6
loss_tie           2
Name: 6, dtype: object

In [7]:
# we can use numpy function on our pandas frames...
import numpy as np

In [8]:
np.sqrt(stats['played'])

t1    2.449490
t2    2.000000
t3    1.732051
t4    2.236068
t5    1.000000
t6    2.645751
t7    2.828427
Name: played, dtype: float64

In [22]:
display(stats)
np.sum(stats)

           teams  played  points  win  loss_tie
t1      Pakistan       6      10    5         1
t2         India       4       4    2         2
t3      Srilanka       3       6    3         0
t4  South Africa       5       8    4         1
t5   West Indies       1       5    2        -1
t6    Bangladesh       7       3    1         6
t7      Newzland       8      12    6         2

teams       PakistanIndiaSrilankaSouth AfricaWest IndiesBa...
played                                                     34
points                                                     48
win                                                        23
loss_tie                                                   11
dtype: object

In [21]:
np.sum(stats['played'])

34

In [ ]:
.abs & absolute are same...

In [17]:
np.abs(stats['played'])

t1    6
t2    4
t3    3
t4    5
t5    1
t6    7
t7    8
Name: played, dtype: int64

In [18]:
np.absolute(stats['played'])

t1    6
t2    4
t3    3
t4    5
t5    1
t6    7
t7    8
Name: played, dtype: int64

# Describe() :
* returns all descriptive statistical calculations

In [15]:
stats.describe()

         played     points       win  loss_tie
count  7.000000   7.000000  7.000000  7.000000
mean   4.857143   6.857143  3.285714  1.571429
std    2.410295   3.287784  1.799471  2.225395
min    1.000000   3.000000  1.000000 -1.000000
25%    3.500000   4.500000  2.000000  0.500000
50%    5.000000   6.000000  3.000000  1.000000
75%    6.500000   9.000000  4.500000  2.000000
max    8.000000  12.000000  6.000000  6.000000

# assignment: 
* various descriptive statistics methods

## how to save a dataframe in `csv format`:
* `frame.to_csv('name_of_file.csv')`

In [35]:
stats.to_csv("stats_data.csv")

 ## how to load a csv format file:
 * `variable_name = pd.read_csv('File_name.csv')`

In [36]:
my_data = pd.read_csv('stats_data.csv')

In [34]:
my_data

           teams  played  points  win  loss_tie
t1      Pakistan       6      10    5         1
t2         India       4       4    2         2
t3      Srilanka       3       6    3         0
t4  South Africa       5       8    4         1
t5   West Indies       1       5    2        -1
t6    Bangladesh       7       3    1         6
t7      Newzland       8      12    6         2

In [31]:
# to avoid the index column that is inserted by default while saving the frame in csv, Use:
my_data = pd.read_csv('stats_data.csv', index_col = 0)

In [32]:
my_data

           teams  played  points  win  loss_tie
t1      Pakistan       6      10    5         1
t2         India       4       4    2         2
t3      Srilanka       3       6    3         0
t4  South Africa       5       8    4         1
t5   West Indies       1       5    2        -1
t6    Bangladesh       7       3    1         6
t7      Newzland       8      12    6         2

In [6]:
# to display without header:
my_data = pd.read_csv('stats_data.csv', index_col = 0, header= None)

In [7]:
my_data

                1       2       3    4         5
0
NaN         teams  played  points  win  loss_tie
t1       Pakistan       6      10    5         1
t2          India       4       4    2         2
t3       Srilanka       3       6    3         0
t4   South Africa       5       8    4         1
t5    West Indies       1       5    2        -1
t6     Bangladesh       7       3    1         6
t7       Newzland       8      12    6         2

In [26]:
stats['played'].sum()

34

In [28]:
stats['points'].sum()

48